Repository: seilbahn/CS-Sorting-algorithms
Catalog: Code/Resource.*.resx
Languages: ru

# ApplicationName
source: Sorting algorithms
ru: Алгоритмы сортировки

# ArrayType
source: Type of the array
ru: Тип массива

source: Average case
ru: Средний случай

source: Best case
ru: Лучший случай

source: Bogo sort
ru: Обезьянья/бесполезная сортировка

source: Bubble sort
ru: Сортировка пузырьком

source: Cocktail sort
ru: Сортировка перемешиванием

source: Comb sort
ru: Сортировка расчёской

source: Comparisons
ru: Сравнения

source: Created
ru: Создан

source: Default sort
ru: Сортировка по умолчанию

# False
source: No
ru: Нет

source: Few unique
ru: Мало уникальных элементов

source: Gnome sort
ru: Гномья сортировка

source: Heap sort
ru: Пирамидальная сортировка

source: Input array
ru: Входной массив

source: Input array length
ru: Длина входного массива

source: Insertion sort
ru: Сортировка вставками

# IsArraySorted
source: Is the array sorted?
ru: Отсортирован ли массив?

source: Is the algorithm stabil?
ru: Устойчив ли алгоритм?

source: Merge sort
ru: Сортировка слиянием

source: ms
ru: мс

source: Nearly sorted
ru: Почти отсортированный

source: New
ru: Новый

source: Output array
ru: Выходной массив

source: Output array length
ru: Длина выходного массива

source: Quick sort
ru: Быстрая сортировка

source: Random
ru: Случайный

source: Report
ru: Отчёт

# ReportsFolderName
source: Sorting algorithms reports
ru: Отчёты алгоритмов сортировки

source: Reversed
ru: Обратно отсортированный

source: Selection sort
ru: Сортировка выбором

source: Shell sort
ru: Сортировка Шелла

source: Sorted
ru: Отсортированный

source: Sorting algorithm
ru: Алгоритм сортировки

source: Space complexity
ru: Затраты памяти

source: Stooge sort
ru: Придурковатая сортировка

source: Swaps
ru: Обмены

source: Time
ru: Время

source: Time complexity
ru: Временная сложность алгоритма

source: Tree sort
ru: Сортировка с помощью двоичного дерева

# True
source: Yes
ru: Да

source: User
ru: Пользователь

source: Worst case
ru: Худший случай
